Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM028.atdf
      <value-group caption="Channel Source Size bits" name="DCH2SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH3SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH0DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH1DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH2DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Size bits" name="DCH3DSIZ__CHDSIZ">
         <value caption="65535 byte destination size" name="" value="0xffff" />
         <value caption="2 byte destination size" name="" value="0x2" />
         <value caption="1 byte destination size" name="" value="0x1" />
         <value caption="65536 byte destination size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH0SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH1SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH2SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH3SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff" />
         <value caption="Points to byte 1 of the source" name="" value="0x1" />
         <value caption="Points to byte 0 of the source" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH0DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH1DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH2DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH3DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH0CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH1CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH2CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH3CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x1" />
         <value caption="65536 bytes transferred on an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH0CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH1CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH2CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH3CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
   </module>
