Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM028.atdf
      <value-group caption="Run Mode Watchdog Timer Clock Source Selection bits" name="FWDT__RCLKSEL">
         <value caption="Clock source is system clock" name="SYSCLK" value="0x0" />
         <value caption="Clock source is FRC oscillator" name="FRC" value="0x2" />
         <value caption="Clock source is LPRC (same as for sleep mode)" name="LPRC" value="0x3" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="FWDT__FWDTEN">
         <value caption="WDT is enabled" name="ON" value="0x1" />
         <value caption="WDT is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Oscillator Selection bits" name="FOSCSEL__FNOSC">
         <value caption="Fast RC oscillator (FRC) with divide-by-N" name="FRCDIV" value="0x0" />
         <value caption="Primary or FRC oscillator with PLL" name="PLL" value="0x1" />
         <value caption="Primary oscillator (XT, HS, EC)" name="PRI" value="0x2" />
         <value caption="Low power secondary oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Low power RC oscillator (LPRC)" name="LPRC" value="0x5" />
      </value-group>
      <value-group caption="System PLL Input Clock Selection bit" name="FOSCSEL__PLLSRC">
         <value caption="Primary oscillator is selected as PLL reference input on device reset" name="PRI" value="0x0" />
         <value caption="FRC oscillator is selected as PLL reference input on device reset" name="FRC" value="0x1" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="FOSCSEL__SOSCEN">
         <value caption="Secondary oscillator is enabled" name="ON" value="0x1" />
         <value caption="Secondary oscillator is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Two Speed Startup Enable bit" name="FOSCSEL__IESO">
         <value caption="Two speed startup is enabled" name="ON" value="0x1" />
         <value caption="Two speed startup is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Selection bit" name="FOSCSEL__POSCMOD">
         <value caption="External clock mode is selected" name="EC" value="0x0" />
         <value caption="XT oscillator mode is selected" name="XT" value="0x1" />
         <value caption="HS oscillator mode is selected" name="HS" value="0x2" />
         <value caption="Primary oscillator is disabled" name="OFF" value="0x3" />
      </value-group>
      <value-group caption="System Clock on CLKO Pin Enable bit" name="FOSCSEL__OSCIOFNC">
         <value caption="System clock is connected to CLKO/OSC2 pin" name="ON" value="0x0" />
         <value caption="OSCO pin operates as a normal I/O" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Secondary Oscillator External Clock Enable bit" name="FOSCSEL__SOSCSEL">
         <value caption="SOSC pins configured for Crystal mode" name="OFF" value="0x1" />
         <value caption="SCLKI pin configured for Digital mode" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Clock Switching and Fail-Safe Clock Monitor Enable bits" name="FOSCSEL__FCKSM">
         <value caption="Clock switching is disabled; Fail-safe clock monitor is disabled" name="CSDCMD" value="0x0" />
         <value caption="Clock switching is enabled; Fail-safe clock monitor is disabled" name="CSECMD" value="0x1" />
         <value caption="Clock switching is disabled; Fail-safe clock monitor is enabled" name="CSDCME" value="0x2" />
         <value caption="Clock switching is enabled; Fail-safe clock monitor is enabled" name="CSECME" value="0x3" />
      </value-group>
      <value-group caption="Code Protection Enable bit" name="FSEC__CP">
         <value caption="Code protection is enabled" name="ON" value="0x0" />
         <value caption="Code protection is disabled" name="OFF" value="0x1" />
      </value-group>
   </module>
   <module caption="" id="02922" name="GPIO" version="">
      <register-group name="GPIO">
         <register caption="" name="RPCON" offset="0xf0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000800" name="IOLOCK" />
         </register>
         <register caption="" name="RPINR1" offset="0x110" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="INT4R" />
         </register>
         <register caption="" name="RPINR2" offset="0x120" rw="RW" size="4">
            <bitfield caption="" mask="0x001F0000" name="ICM1R" />
            <bitfield caption="" mask="0x1F000000" name="ICM2R" />
         </register>
         <register caption="" name="RPINR3" offset="0x130" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="ICM3R" />
            <bitfield caption="" mask="0x00001F00" name="ICM4R" />
         </register>
         <register caption="" name="RPINR5" offset="0x150" rw="RW" size="4">
            <bitfield caption="" mask="0x001F0000" name="OCFAR" />
            <bitfield caption="" mask="0x1F000000" name="OCFBR" />
         </register>
         <register caption="" name="RPINR6" offset="0x160" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="TCKIAR" />
            <bitfield caption="" mask="0x00001F00" name="TCKIBR" />
         </register>
         <register caption="" name="RPINR7" offset="0x170" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="ICM5R" />
            <bitfield caption="" mask="0x00001F00" name="ICM6R" />
            <bitfield caption="" mask="0x001F0000" name="ICM7R" />
            <bitfield caption="" mask="0x1F000000" name="ICM8R" />
         </register>
         <register caption="" name="RPINR8" offset="0x180" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="ICM9R" />
            <bitfield caption="" mask="0x1F000000" name="U3RXR" />
         </register>
         <register caption="" name="RPINR9" offset="0x190" rw="RW" size="4">
            <bitfield caption="" mask="0x001F0000" name="U2RXR" />
            <bitfield caption="" mask="0x1F000000" name="U2CTSR" />
         </register>
         <register caption="" name="RPINR10" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="" mask="0x1F000000" name="U3CTSR" />
         </register>
         <register caption="" name="RPINR11" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="SDI2R" />
            <bitfield caption="" mask="0x00001F00" name="SCK2INR" />
            <bitfield caption="" mask="0x001F0000" name="SS2INR" />
         </register>
         <register caption="" name="RPINR12" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="" mask="0x001F0000" name="CLCINAR" />
            <bitfield caption="" mask="0x1F000000" name="CLCINBR" />
         </register>
