Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/atdf/PIC32MM0256GPM028.atdf
         <register caption="" name="IPC16" offset="0x82d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="I2C1SIS" />
            <bitfield caption="" mask="0x00001C00" name="I2C1SIP" />
            <bitfield caption="" mask="0x00030000" name="I2C1MIS" />
            <bitfield caption="" mask="0x001C0000" name="I2C1MIP" />
            <bitfield caption="" mask="0x03000000" name="I2C1BCIS" />
            <bitfield caption="" mask="0x1C000000" name="I2C1BCIP" />
         </register>
         <register caption="" name="IPC17" offset="0x82e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="I2C2SIS" />
            <bitfield caption="" mask="0x0000001C" name="I2C2SIP" />
            <bitfield caption="" mask="0x00000300" name="I2C2MIS" />
            <bitfield caption="" mask="0x00001C00" name="I2C2MIP" />
            <bitfield caption="" mask="0x00030000" name="I2C2BCIS" />
            <bitfield caption="" mask="0x001C0000" name="I2C2BCIP" />
            <bitfield caption="" mask="0x03000000" name="I2C3SIS" />
            <bitfield caption="" mask="0x1C000000" name="I2C3SIP" />
         </register>
         <register caption="" name="IPC18" offset="0x82f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="I2C3MIS" />
            <bitfield caption="" mask="0x0000001C" name="I2C3MIP" />
            <bitfield caption="" mask="0x00000300" name="I2C3BCIS" />
            <bitfield caption="" mask="0x00001C00" name="I2C3BCIP" />
            <bitfield caption="" mask="0x00030000" name="CCP1IS" />
            <bitfield caption="" mask="0x001C0000" name="CCP1IP" />
            <bitfield caption="" mask="0x03000000" name="CCT1IS" />
            <bitfield caption="" mask="0x1C000000" name="CCT1IP" />
         </register>
         <register caption="" name="IPC19" offset="0x8300" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CCP2IS" />
            <bitfield caption="" mask="0x0000001C" name="CCP2IP" />
            <bitfield caption="" mask="0x00000300" name="CCT2IS" />
            <bitfield caption="" mask="0x00001C00" name="CCT2IP" />
            <bitfield caption="" mask="0x00030000" name="CCP3IS" />
            <bitfield caption="" mask="0x001C0000" name="CCP3IP" />
            <bitfield caption="" mask="0x03000000" name="CCT3IS" />
            <bitfield caption="" mask="0x1C000000" name="CCT3IP" />
         </register>
         <register caption="" name="IPC20" offset="0x8310" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CCP4IS" />
            <bitfield caption="" mask="0x0000001C" name="CCP4IP" />
            <bitfield caption="" mask="0x00000300" name="CCT4IS" />
            <bitfield caption="" mask="0x00001C00" name="CCT4IP" />
            <bitfield caption="" mask="0x00030000" name="CCP5IS" />
            <bitfield caption="" mask="0x001C0000" name="CCP5IP" />
            <bitfield caption="" mask="0x03000000" name="CCT5IS" />
            <bitfield caption="" mask="0x1C000000" name="CCT5IP" />
         </register>
         <register caption="" name="IPC21" offset="0x8320" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CCP6IS" />
            <bitfield caption="" mask="0x0000001C" name="CCP6IP" />
            <bitfield caption="" mask="0x00000300" name="CCT6IS" />
            <bitfield caption="" mask="0x00001C00" name="CCT6IP" />
            <bitfield caption="" mask="0x00030000" name="CCP7IS" />
            <bitfield caption="" mask="0x001C0000" name="CCP7IP" />
            <bitfield caption="" mask="0x03000000" name="CCT7IS" />
            <bitfield caption="" mask="0x1C000000" name="CCT7IP" />
         </register>
         <register caption="" name="IPC22" offset="0x8330" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CCP8IS" />
            <bitfield caption="" mask="0x0000001C" name="CCP8IP" />
            <bitfield caption="" mask="0x00000300" name="CCT8IS" />
            <bitfield caption="" mask="0x00001C00" name="CCT8IP" />
            <bitfield caption="" mask="0x00030000" name="CCP9IS" />
            <bitfield caption="" mask="0x001C0000" name="CCP9IP" />
            <bitfield caption="" mask="0x03000000" name="CCT9IS" />
            <bitfield caption="" mask="0x1C000000" name="CCT9IP" />
         </register>
         <register caption="" name="IPC23" offset="0x8340" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="FSTIS" />
            <bitfield caption="" mask="0x0000001C" name="FSTIP" />
            <bitfield caption="" mask="0x00030000" name="NVMIS" />
            <bitfield caption="" mask="0x001C0000" name="NVMIP" />
            <bitfield caption="" mask="0x03000000" name="CPCIS" />
            <bitfield caption="" mask="0x1C000000" name="CPCIP" />
         </register>
         <register caption="" name="IPC24" offset="0x8350" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="ECCBEIS" />
            <bitfield caption="" mask="0x00001C00" name="ECCBEIP" />
            <bitfield caption="" mask="0x00030000" name="DMA0IS" />
            <bitfield caption="" mask="0x001C0000" name="DMA0IP" />
            <bitfield caption="" mask="0x03000000" name="DMA1IS" />
            <bitfield caption="" mask="0x1C000000" name="DMA1IP" />
         </register>
         <register caption="" name="IPC25" offset="0x8360" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="DMA2IS" />
            <bitfield caption="" mask="0x0000001C" name="DMA2IP" />
            <bitfield caption="" mask="0x00000300" name="DMA3IS" />
            <bitfield caption="" mask="0x00001C00" name="DMA3IP" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
